stud_card = [
    ("ID", "Имя", "Фамилия", "Дата рождения", "Успеваемость"),
    [ "1", "Иван", "Петров", "17.08.2000", "Отличник"],
    [ "2", "Сергей", "Бойко", "04.05.2001", "Троечник"],
    [ "3", "Екатерина", "Литовченко", "01.04.1999", "Хорошист"],
    ["4", "Ольга", "Мессинг", "23.02.2002", "Отличник"],
    ["5", "Мария", "Пастернак", "08.03.2004", "Хорошист"]
]

class_card = [
    ('Предмет', 'Номер парты', 'Ряд', 'Вид парты', 'ID'),
    ['Русский язык', '1', 'Первый ряд', 'Одноместная', '1'],
    ['Химия', '2', 'Второй ряд', 'Одноместная', '2'],
    ['Физика', '3', 'Третий ряд', 'Двуместная ', '3'],
    ['Биология', '4', 'Четвертый ряд', 'Двуместная ', '4',],
    ['Информатика', '5', 'Пятый ряд', 'Одноместная', '5']
]

def add_student():
    new_user = []
    new_user.append(str(len(stud_card)))
    new_user.append(input('Введите имя: '))
    new_user.append(input('Введите фамилию: '))
    new_user.append(input('Введите дату рождения: '))
    new_user.append(input('Введите успеваемость: '))
    stud_card.append(new_user)
    new_user_class_data = []
    new_user_class_data.append(input("На каком уроке ученик?: "))
    new_user_class_data.append(input('За какой партой сидит?: '))
    new_user_class_data.append(input('Какой номер ряда?: '))
    new_user_class_data.append(input('Введите вид парты: '))
    new_user_class_data.append(str(len(class_card)))
    class_card.append(new_user_class_data)
